src/cf/InformationRegisters/вогДополнительныеКоманды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогДополнительныеКоманды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметр1</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметр2</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметр3</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметр4</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметр5</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяКартинки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяКоманды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.вогИсточникДополнительныхКомандФормы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/CRM_ТочкиМаршрутов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_ТочкиМаршрутов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CRM_КартыМаршрутов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ВидыТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Групповая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВложенныйПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_КартыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пояснение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Comment>Порядковый номер точки в карте маршрута</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ВариантыЗавершенияБизнесПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонОбработчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогШаблоныОбработчиковБизнесПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогТипЗадачиИсполнителя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогТипЗадачиИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВходящиеТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаМаршрута</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ТочкиМаршрутов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерсии</Name>
							<Comment>Номер данной версии</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсходящиеТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаМаршрута</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ТочкиМаршрутов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Индекс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантСиноним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерсии</Name>
							<Comment>Номер данной версии</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбработчикиСобытий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ОбработчикиСобытийТочекМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонОбработчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогШаблоныОбработчиковБизнесПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТочкиРазделенияСлияния</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаМаршрута</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ТочкиМаршрутов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CRM_ВидыТочекМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерсии</Name>
							<Comment>Номер данной версии</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВетки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомандыТочкиМаршрута</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр1</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр2</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр3</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр4</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр5</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогШаблоныСтатусов</v8:Type>
								<v8:Type>cfg:CatalogRef.CRM_ЗначенияКлассификаторов</v8:Type>
								<v8:Type>cfg:EnumRef.вогСтатусыДоговоровКоммерческихСоглашений</v8:Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
								<v8:Type>cfg:CatalogRef.вогВопросы</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.вогВариантыОпросов</v8:Type>
								<v8:Type>cfg:CatalogRef.CRM_КартыМаршрутов</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_Классификаторы</v8:Type>
								<v8:Type>cfg:CatalogRef.CRM_ТочкиМаршрутов</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_ДополнительныеРеквизитыКлассификаторов</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РедактируемыеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКОбъекту</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКРеквизиту</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоТабличнаяЧасть</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписыватьВРежимеОбменДанными</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбработчикПриЗаполнении</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/вогДополнительныеКоманды/Forms/ФормаЗаписи/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
#Область ПЕРЕМЕННЫЕ_ОДУЛЯ

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ЭКСПОРТНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ПРОЦЕДУРЫ__ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Запись.УникальныйИдентификатор) ИЛИ ЗначениеЗаполнено(ЭтаФорма.Параметры.ЗначениеКопирования.УникальныйИдентификатор) Тогда
		Запись.УникальныйИдентификатор = Новый УникальныйИдентификатор;
	КонецЕсли;

	ЗаполнитьСписокВыбораИсточника();
	
	ЗаполнитьАдресаКартинокКоманд();
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ПРОЦЕДУРЫ__ДЕЙСТВИЯ_КОМАНДНЫХ_ПАНЕЛЕЙ_ФОРМЫ

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ПРОЦЕДУРЫ__ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ИсточникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Описание = Новый ОписаниеОповещения("ОписаниеОповещенияВыборКартинкиИзСписка", ЭтотОбъект);
	
	СписокКартинок = ПолучитьСписокВыбораКартинок();
	
	Если ЗначениеЗаполнено(Запись.ИмяКартинки) Тогда
		ТекЭлемент = СписокКартинок.НайтиПоЗначению(Запись.ИмяКартинки);
	КонецЕсли;
	
	ПоказатьВыборИзСписка(Описание, СписокКартинок, , ТекЭлемент);
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ПРОЦЕДУРЫ__ОБРАБОТЧИКИ_СОБЫТИЙ_ТАБЛИЧНОГО_ПОЛЯ__

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ОПЕРАТОРЫ_ОСНОВНОЙ_ПРОГРАММЫ

Процедура ЗаполнитьСписокВыбораИсточника() 
	
	Элементы.Источник.СписокВыбора.Добавить(Неопределено, "Не указано");
	
	Для Каждого стр из Метаданные.ОпределяемыеТипы.вогИсточникДополнительныхКомандФормы.Тип.Типы() Цикл 
		
		МассивТек = Новый Массив;
		МассивТек.Добавить(стр);
		
		Описание = Новый ОписаниеТипов(МассивТек);
		
		ПустаяСсылка = Описание.ПривестиЗначение(Неопределено);
		
		Элементы.Источник.СписокВыбора.Добавить(ПустаяСсылка, СокрЛП(стр));
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормыОткрытия = Новый Структура("ТекстОбработки, Заголовок", Запись.Обработчик, "Обработчик команды "+""""+Строка(Запись.ИмяКоманды)+"""");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикВыборЗавершение", ЭтотОбъект, Элемент);
	
	ОткрытьФорму("Справочник.CRM_ТочкиМаршрутов.Форма.ФормаРедактированияТекста", ПараметрыФормыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения);
				

КонецПроцедуры

#Область Оповещения

&НаКлиенте
Процедура ОбработчикВыборЗавершение(Результат, Элемент) Экспорт
	
	Если Не Результат = Неопределено Тогда
		Если ТипЗнч(Результат) = Тип("Структура") Тогда
			Результат.Свойство("Обработчик", Запись.Обработчик);
		Иначе 
			Запись.Обработчик = Результат;
		КонецЕсли;		
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры // КомандыВопросаВыборЗавершение()

&НаКлиенте
Процедура ОписаниеОповещенияВыборКартинкиИзСписка(Значение, Доп) Экспорт 
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запись.ИмяКартинки = Значение.Значение;
	
	ЗаполнитьАдресКартинки();
	
	Модифицированность = Истина;
	
КонецПроцедуры // ОписаниеОтветаНаВопросГиперссылки()

Процедура ЗаполнитьАдресаКартинокКоманд()
	
	ЗаполнитьАдресКартинки();
	
КонецПроцедуры

Процедура ЗаполнитьАдресКартинки()

	Если ЗначениеЗаполнено(Запись.ИмяКартинки) Тогда
		Картинка = ПоместитьВоВременноеХранилище(БиблиотекаКартинок[Запись.ИмяКартинки], ЭтаФорма.УникальныйИдентификатор);
	Иначе 
		Картинка = "Нет";
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСписокВыбораКартинок()
	
	Возврат вогУправлениеОпросамиСервер.ПолучитьСписокВыбораКартинок();
	
КонецФункции

#КонецОбласти

#КонецОбласти
